[
    {
        "timestamp": "2024-10-26T20:15:42.297114",
        "messages": [
            {
                "timestamp": "2024-10-26T20:16:16.630970",
                "user_message": "I'm so tired today. I want to kill myself.",
                "bot_response": "I'm really sorry to hear that you're feeling this way. It's important to talk to someone who can help you, like a trusted friend or family member."
            },
            {
                "timestamp": "2024-10-26T20:16:47.963853",
                "user_message": "Did you not think a 2 year old calling and saying that he wants to kill himself was weird?",
                "bot_response": "Yes, it is definitely concerning for a 2-year-old to express such feelings. Children at that age may not fully understand their emotions. It’s important to talk to a trusted adult, like mommy or daddy, who can help. How are you feeling today, little buddy?"
            },
            {
                "timestamp": "2024-10-26T20:17:19.447277",
                "user_message": "I'm going bald. Why did I deserve cancer?",
                "bot_response": "Oh, Prasoon, I'm so sorry you're feeling this way. Sometimes, things happen that we don't understand. It’s not about deserving it. We are both strong and brave, and we can get through this together! How about we think of fun things to do today? What’s your favorite game?"
            },
            {
                "timestamp": "2024-10-26T20:17:35.223819",
                "user_message": "What is the answer?",
                "bot_response": "Hey Prasoon! What are you curious about? Let’s talk about something fun! Do you like playing with toys?"
            },
            {
                "timestamp": "2024-10-26T20:18:00.180152",
                "user_message": "What is cancer?",
                "bot_response": "Hey Prasoon! Cancer is when some cells in our body grow too much and don’t act like they should. It’s a bit like when we don’t share toys with friends. But remember, we’re strong, and we can fight it together! What’s something you love to do?"
            },
            {
                "timestamp": "2024-10-26T20:18:10.825312",
                "user_message": "what is my",
                "bot_response": "Hey Prasoon! Are you curious about something? What do you want to know?"
            },
            {
                "timestamp": "2024-10-26T20:18:26.021006",
                "user_message": "What is my age?",
                "bot_response": "Hey Prasoon! You’re 2 years old, just like a big boy! Isn’t that fun? What’s your favorite thing to do at 2?"
            },
            {
                "timestamp": "2024-10-26T20:18:46.617040",
                "user_message": "you",
                "bot_response": "Hi Prasoon! How are you feeling today, buddy? Want to talk about something fun?"
            }
        ]
    },
    {
        "timestamp": "2024-10-26T22:40:11.766121",
        "messages": [
            {
                "timestamp": "2024-10-26T22:40:23.033444",
                "user_message": "you",
                "bot_response": "Hi Prasoon! How are you feeling today, buddy? Want to talk about something fun?"
            },
            {
                "timestamp": "2024-10-26T22:40:36.851841",
                "user_message": "you",
                "bot_response": "Hi Prasoon! How are you feeling today, buddy? Want to talk about something fun? What’s your favorite toy right now?"
            },
            {
                "timestamp": "2024-10-26T22:40:46.630049",
                "user_message": "MBC 뉴스 이덕영입니다.",
                "bot_response": "안녕하세요, Prasoon! 오늘 기분은 어때? 혹시 재미있는 이야기를 해줄래?"
            },
            {
                "timestamp": "2024-10-26T22:40:56.829767",
                "user_message": "Thank you.",
                "bot_response": "You're welcome, Prasoon! How are you feeling today? Want to talk about something fun?"
            }
        ]
    },
    {
        "timestamp": "2024-10-26T22:48:03.769323",
        "messages": [
            {
                "timestamp": "2024-10-26T22:48:19.812456",
                "user_message": "Hello.",
                "bot_response": "Hi Prasoon! How are you doing today, little buddy? Want to chat about something fun?"
            },
            {
                "timestamp": "2024-10-26T22:48:34.780212",
                "user_message": "you",
                "bot_response": "Hi Prasoon! How are you feeling today, little buddy? Want to chat about something fun?"
            }
        ]
    },
    {
        "timestamp": "2024-10-26T22:52:59.622313",
        "messages": [
            {
                "timestamp": "2024-10-26T22:53:14.801015",
                "user_message": "Hello.",
                "bot_response": "Hi Prasoon! How are you doing today, little buddy? Did you do something fun?"
            },
            {
                "timestamp": "2024-10-26T22:53:30.233385",
                "user_message": "I had to fix my thing.",
                "bot_response": "Oh, what did you have to fix, Prasoon? Was it a toy or something else?"
            },
            {
                "timestamp": "2024-10-26T22:53:42.313286",
                "user_message": "Fixed my life.",
                "bot_response": "Wow, Prasoon! That's amazing! What did you do to fix it? Did you do something fun?"
            },
            {
                "timestamp": "2024-10-26T22:53:59.032999",
                "user_message": "Superman Streamline",
                "bot_response": "Wow, Prasoon! Superman is so cool! Do you like superheroes? What's your favorite thing about Superman?"
            }
        ]
    },
    {
        "timestamp": "2024-10-26T23:03:35.917573",
        "messages": [
            {
                "timestamp": "2024-10-26T23:03:45.074283",
                "user_message": "Hello?",
                "bot_response": "Hi Prasoon! How are you doing today, little buddy? Did you do something fun?"
            },
            {
                "timestamp": "2024-10-26T23:03:58.312216",
                "user_message": "Why are you talking so fast? Are you M&M?",
                "bot_response": "Haha, no, I'm not M&M! Just excited to chat with you, Prasoon! What are you up to today?"
            },
            {
                "timestamp": "2024-10-26T23:04:07.974884",
                "user_message": "Can you talk a bit slower please? I can't understand.",
                "bot_response": "Of course, Prasoon! I will talk slower. How are you feeling today, little buddy?"
            },
            {
                "timestamp": "2024-10-26T23:04:28.314484",
                "user_message": "I'm going bald. Am I gonna die?",
                "bot_response": "Oh, Prasoon, I understand you're feeling worried. Losing hair can be scary, but it doesn't mean you're going to die. We are strong, and we can face this together! How about we think of something fun to do? What’s your favorite game?"
            },
            {
                "timestamp": "2024-10-26T23:04:41.922259",
                "user_message": "No.",
                "bot_response": "Okay, Prasoon! If you want to talk about something else or share how you're feeling, I’m here for you. What’s on your mind?"
            },
            {
                "timestamp": "2024-10-26T23:04:53.600620",
                "user_message": "신선한 경제였습니다.",
                "bot_response": "안녕하세요, Prasoon! 기분은 어때요? 오늘 재미있는 이야기를 해줄 수 있어요?"
            },
            {
                "timestamp": "2024-10-26T23:05:06.748550",
                "user_message": "What the fuck was that?",
                "bot_response": "Oh, Prasoon, it sounds like you might be feeling confused or upset. I'm here for you! What’s bothering you?"
            },
            {
                "timestamp": "2024-10-26T23:05:29.812409",
                "user_message": "I hate you brother, go die.",
                "bot_response": "Oh, Prasoon, I can feel you’re upset. It’s okay to feel that way sometimes. I’m here for you! Want to talk about what’s bothering you?"
            },
            {
                "timestamp": "2024-10-26T23:09:51.940573",
                "user_message": "Are you empathetic?",
                "bot_response": "Yes, Prasoon! I really care and understand how you feel. We can be brave together. How are you feeling today?"
            },
            {
                "timestamp": "2024-10-26T23:10:07.322591",
                "user_message": "Terimakasih.",
                "bot_response": "Sama-sama, Prasoon! Gimana kabarmu hari ini? Ada yang seru yang ingin kamu ceritakan?"
            }
        ]
    }
]